<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="utf-8" />
<title>Los nombres propios en el mundo</title>
<meta name="description" content="¿En qué se diferencian los nombres propios de los distintos lugares del mundo y qué implican estas diferencias para el diseño de contenido web como formularios, bases de datos, ontologías, etc.?" />
<script type="application/javascript">
var f = { }

// AUTHORS should fill in these assignments:
f.directory = 'questions'+'/'; // the name of the directory this file is in
f.filename = 'qa-personal-names'; // the file name WITHOUT extensions
f.authors = 'Richard Ishida, W3C'; // author(s) and affiliations
f.previousauthors = ''; // as above
f.modifiers = ''; // people making substantive changes, and their affiliation
f.searchString = 'article-qa-personal-names'; // blog search string - usually the filename without extensions
f.firstPubDate = '2011-08-17'; // date of the first publication of the document (after review)
f.lastSubstUpdate = { date:'2011-08-17', time:'19:22'}  // date and time of latest substantive changes to this document
f.status = 'published';  // should be one of draft, review, published, or notreviewed
f.path = '../' // what you need to prepend to a URL to get to the /International directory 

// AUTHORS AND TRANSLATORS should fill in these assignments:
f.thisVersion = { date:'26/06/2019', time:'10:40'} // date and time of latest edits to this document/translation
f.contributors = ''; // people providing useful contributions or feedback during review or at other times
// also make sure that the lang attribute on the html tag is correct!

// TRANSLATORS should fill in these assignments:
f.translators = 'Carlos Mateo Márquez, Universidad Pablo de Olavide'; // translator(s) and their affiliation - a elements allowed, but use double quotes for attributes

f.breadcrumb = 'forms';

f.additionalLinks = ''
</script>
<script type="text/javascript" src="qa-personal-names-data/translations.js"> </script>
<script type="text/javascript" src="../javascript/doc-structure/article-dt.js"> </script>
<script type="text/javascript" src="../javascript/boilerplate-text/boilerplate-es.js"> </script><!-- TRANSLATORS must change -en to the subtag for their language! --><script type="text/javascript" src="../javascript/doc-structure/article.js"> </script>
<script type="text/javascript" src="../javascript/articletoc-html5.js"></script>
<link rel="stylesheet" href="../style/article-2016.css" type="text/css" />
<link rel="stylesheet" href="qa-personal-names-data/local.css" type="text/css" />
<link rel="copyright" href="#copyright"/><!--[if lt IE 9]><script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script><![endif]--></head>

<body>
<header>
  <nav id="mainNavigation"></nav><script>document.getElementById('mainNavigation').innerHTML = mainNavigation</script>
  
  <h1>Los nombres propios en el mundo</h1>
</header>


<section>
  <div id="audience">
    <p><span id="intendedAudience" class="leadin">Público de destino:</span> creadores de contenido HTML (que usen editores o lenguaje de script), desarrolladores de script (PHP, JSP, etc.),  desarrolladores de esquema (DTDs, XML Schema, RelaxNG, etc.), directores de proyectos web y todo aquel involucrado en el dise&ntilde;o de formularios, bases de datos y ontolog&iacute;as sobre nombres personales.</p>
    <div id="updateInfo"></div><script>document.getElementById('updateInfo').innerHTML = g.updated</script> 
  </div>
  <h2 id="question"><a href="#question">Pregunta</a></h2>
  <p class="question">¿En qué se diferencian los nombres propios de los distintos lugares del mundo y qué implican estas diferencias para el diseño de contenido web como formularios, bases de datos, ontologías, etc.?</p>
  <p>Normalmente, los creadores de los formularios, bases de datos u ontologías web no son conscientes de lo diferentes que pueden ser los nombres propios en otros pa&iacute;ses y no tienen en cuenta estas particularidades del público extranjero. Este artículo muestra, en primer lugar, algunos de los estilos usados para tratar nombres propios, además de las implicaciones que pueda tener para su gestión web.</p>
  <p>Este art&iacute;culo no recoge todas las soluciones sobre este asunto, ya que estas variar&aacute;n en funci&oacute;n de las necesidades de la aplicación y, en la mayor&iacute;a de los casos, es muy dif&iacute;cil encontrar una soluci&oacute;n «perfecta». El principal propósito de este artículo es exponer algunos de los problemas principales a modo de presentación. Los ejemplos y consejos que aparecer&aacute;n son para formularios y bases de datos web. Sin embargo, la mayor&iacute;a de los aspectos que se van a tratar son &uacute;tiles para el campo ontol&oacute;gico, aunque no se vayan a plantear ejemplos concretos.</p>
</section>


<section>
  <h2 id="scenarios"><a href="#scenarios">Situaciones</a></h2>
  <p>Hay que tener en cuenta dos situaciones clave:</p>
  <ol>
    <li>
      <p>Si se va a diseñar un formulario en un solo idioma (en ingl&eacute;s, por ejemplo) disponible para un público de todo el mundo.</p>
    </li>
    <li>
      <p>O si se va a diseñar un formulario en un solo idioma, pero este se adaptará a las diferencias culturales una vez localizado el sitio web.</p>
    </li>
  </ol>
  <p>Probablemente no sea posible realizar una localizaci&oacute;n para cada cultura, por lo que, aunque elijas la segunda situaci&oacute;n, seguir&aacute;n habiendo personas que rellenar&aacute;n el formulario sin estar localizado en su propia cultura.</p>
</section>


<section>
  <h2 id="examples"><a href="#examples">Ejemplos de diferencias culturales</a></h2>
  <p>Para comenzar, vamos a ver algunos ejemplos de c&oacute;mo pueden variar los nombres propios en todo el mundo.</p>
  <section>
    <h3 id="patronymic"><a href="#patronymic">Nombres de pila y patron&oacute;micos</a></h3>
    <p>En el nombre island&eacute;s <b class="highlight">Bj&ouml;rk Gu&eth;mundsd&oacute;ttir</b>, Bj&ouml;rk es el nombre de pila. La segunda parte del nombre hace referencia al nombre del padre (o, en algunas ocasiones, de la madre) seguido de <span class="suffix">‑son</span> para los hombres y ‑d&oacute;ttir para las mujeres, y es m&aacute;s bien una descripci&oacute;n en lugar de un apellido para la mentalidad occidental. El padre de Bj&ouml;rk, Gu&eth;mundur, era el hijo de Gunnar, por lo que se llamar&iacute;a Gu&eth;mundur Gunnarsson. </p>
    <p>Los islandeses prefieren que se les llame por su nombre de pila (Bj&ouml;rk) o por su nombre completo (Bj&ouml;rk Gu&eth;mundsd&oacute;ttir). Bj&ouml;rk no se esperar&iacute;a que alguien la llamara Sra. Gu&eth;mundsd&oacute;ttir. En Islandia, las gu&iacute;as telef&oacute;nicas se ordenan por nombre de pila.</p>
    <p>Este caso de nombres de pila seguidos de patron&iacute;micos tambi&eacute;n se da en otras culturas como las del sur de India, Malasia o Indonesia.</p>
    <p>En el nombre malayo <b class="highlight">Isa bin Osman</b>, «bin» significa «hijo de» («binti» para mujeres), por lo que para referirte a &eacute;l tendr&iacute;as que llamarlo Sr. Isa o Encik Isa si lo conoces personalmente (Encik significa se&ntilde;or en malayo).</p>
  </section>
  
  <section>
    <h3 id="partorder"><a href="#partorder">Orden diferente en las partes del nombre</a></h3>
    <p>En el nombre chino <b class="highlight">毛泽东</b> (Mao Ze Dong), el apellido es Mao, es decir, el <em>primer</em> nombre que aparece (de izquierda a derecha). El nombre de pila es Dong. El car&aacute;cter del medio, Ze, es el nombre generacional y lo comparte con sus hermanos (por lo que sus hermanos se llamar&iacute;an 毛泽民 (Mao Ze Min) y 毛泽覃 (Mao Ze Tan), y su hermana 毛泽紅 (Mao Ze Hong)).</p>
    <p>Para alguien desconocido, Mao ser&iacute;a 毛泽东先生 (Mao Ze Dong xiān shēng) o 毛先生 (Mao xiān shēng, siendo «xiān shēng» el equivalente a Sr.). Actualmente, no todos los habitantes de China tienen esta particularidad del nombre generacional, especialmente en la China continental. Sin embargo, los que si la tienen esperan que se use junto a su nombre de pila, por lo que alg&uacute;n conocido de 毛泽东 (Mao Ze Dong) lo llamar&iacute;a 泽东 (Ze Dong) en lugar de solo 东 (Dong). </p>
    <p>Ten en cuenta tambi&eacute;n que estos nombres no van separados por espacios.</p>
    <p>Otras culturas, como la japonesa, la coreana y la h&uacute;ngara, tambi&eacute;n siguen este orden de apellido seguido del (de los) nombre(s) de pila.</p>
    <p>Los chinos que tengan que tratar con frecuencia con un p&uacute;blico occidental adoptar&aacute;n un nombre adicional m&aacute;s sencillo para este p&uacute;blico. Por ejemplo, Yao Ming (siendo Yao el apellido y Ming el nombre de pila) puede escribir su nombre como Fred Yao Ming o Fred Ming Yao para los extranjeros. </p>
  </section>
  
  <section>
    <h3 id="multiplefamily"><a href="#multiplefamily">M&uacute;ltiples apellidos</a></h3>
    <p>Los hispanohablantes tienen normalmente dos apellidos. Por ejemplo, <b class="highlight">Mar&iacute;a Jos&eacute; Carre&ntilde;o Qui&ntilde;ones</b> (siendo Jos&eacute; parte de su nombre de pila) ser&iacute;a la hija de Antonio Carre&ntilde;o Rodr&iacute;guez y Mar&iacute;a Qui&ntilde;ones Marqu&eacute;s.</p>
    <p>Para referirte a ella, tendr&iacute;as que llamarla por Se&ntilde;orita Carre&ntilde;o, y no por Se&ntilde;orita Qui&ntilde;ones.</p>
    <p>Los brasile&ntilde;os tienen costumbres muy similares y pueden tener hasta tres o cuatro apellidos, que hacen referencia a los nombres de otros ascendientes, como <b class="highlight">Jos&eacute; Eduardo Santos Tavares Melo Silva</b>.</p>
    <p>Normalmente, los apellidos espa&ntilde;oles siguen el orden paterno-materno, mientras que los nombres portugueses en Brasil seguir&iacute;an el orden materno-paterno. No obstante, este orden puede cambiar.</p>
    <p>Asimismo, algunos nombres a&ntilde;aden preposiciones, como «de», o conjunciones, como «e», entre los apellidos, por ejemplo, Carre&ntilde;o de Qui&ntilde;ones, o Tavares e Silva.</p>
  </section>
  
  <section>
    <h3 id="variants"><a href="#variants">Formas diferentes de nombres</a></h3>
    <p>Ya vimos que el patron&iacute;mico island&eacute;s termina en ‑son o ‑d&oacute;ttir dependiendo de si es un nombre de hombre o de mujer. Los rusos tienen patron&iacute;micos como segundo nombre y tambi&eacute;n apellido, en el orden nombre de pila-patron&iacute;mico-apellido. El final del patron&iacute;mico y del apellido indicar&aacute; si la persona es hombre o mujer. Por ejemplo, la esposa de <b class="highlight">Борис Николаевич Ельцин</b> (Boris Nikolayevich Yeltsin) es <b class="highlight">Наина Иосифовна Ельцина</b> (Naina Iosifovna Yeltsina), terminando los nombres del marido en consonantes y los suyos en ‑a (incluido el patron&iacute;mico de su padre).</p>
  </section>
  
  <section>
    <h3 id="middleinitial"><a href="#middleinitial">Iniciales entre nombres</a></h3>
    <p>Normalmente, los americanos escriben su nombre con una inicial en medio, por ejemplo, <b class="highlight">John Q. Public</b>. Los brit&aacute;nicos tambi&eacute;n comparten esta peculiaridad, incluso pueden tener varios segundos nombres. No obstante, esto se considera algo puramente americano, ya que en otros pa&iacute;ses donde existen los segundos nombres no se suelen indicar estos con una inicial, lo que puede conllevar a confusi&oacute;n a la hora de rellenar un formulario. Adem&aacute;s, tambi&eacute;n se frecuenta la inicial al principio del nombre.</p>
  </section>
  
  <section>
    <h3 id="inheritance"><a href="#inheritance">Herencia de nombres</a></h3>
    <p>Dar por hecho que los miembros de la misma familia comparten el mismo apellido puede ser un error. Existe una tendencia en los pa&iacute;ses occidentales en la que la mujer conserva su apellido tras el matrimonio, mientras que en otras culturas, como la china, se mantiene al contrario. Dependiendo del pa&iacute;s, la mujer tomar&aacute; el apellido del marido o no. Si la chica malaya Zaiton se casara con Isa, ya mencionado anteriormente, podr&iacute;a elegir si mantener su nombre (Sra. Zaiton) o adoptar el de su marido (Zaiton Isa o Sra. Isa).</p>
    <div class="sidenoteGroup">
      <p>Algunos nombres hispanos tienen un enfoque distinto. En 1996, Manuel A. P&eacute;rez Qui&ntilde;ones <a class="print" href="http://web.archive.org/web/19990429161253/http://exodo.upr.clu.edu/~mperez/apellidos.html">describi&oacute;</a> los nombres de su familia. Como hemos mencionado anteriormente, sus apellidos fueron P&eacute;rez Qui&ntilde;ones porque los <span lang="es" xml:lang="es">apellidos</span> de su padre eran P&eacute;rez Rodr&iacute;guez y los de su madre Qui&ntilde;ones Alamo. En su momento, cortej&oacute; a una chica cuyos <span lang="es" xml:lang="es">apellidos</span> eran Padilla Falto y, cuando se casaron, sus <span lang="es" xml:lang="es">apellidos</span> pasaron a ser Padilla de P&eacute;rez. Sus hijos se llamaron P&eacute;rez Padilla y as&iacute; sucesivamente. La cuesti&oacute;n es que solo los hijos de la familia comparten los mismos <span lang="es" xml:lang="es">apellidos</span>.</p>
      <aside class="sideinfonote"><p class="info">He hecho una peque&ntilde;a modificaci&oacute;n en el nombre de Manuel en este art&iacute;culo. De hecho, suele escribir sus apellidos con un gui&oacute;n (P&eacute;rez-Qui&ntilde;ones) para evitar cualquier confusi&oacute;n en EE. UU. sobre su nombre. Esto es algo habitual all&iacute;.</p></aside>
    </div>
    <p>Tampoco deber&iacute;amos asumir que esta adopci&oacute;n de apellidos es exclusiva de marido a mujer. En algunas ocasiones, los hombres toman el apellido de su mujer tras el matrimonio. En estos casos, la mejor opci&oacute;n para un formulario es preguntar por el «Apellido anterior», en lugar del «Apellido de soltera». </p>
  </section>
  
  <section>
    <h3 id="mixing"><a href="#mixing">Creando sus propias mezclas</a></h3>
    <p>Existen muchas culturas que combinan estas diferencias en sus nombres de pila y a&ntilde;aden sus propias novedades. </p>
    <p>Por ejemplo, <b class="highlight">Velikkakathu Sankaran Achuthanandan </b>es un nombre del estado de Kerala (al sur de la India) que se puede escribir tambi&eacute;n como <b class="highlight">V. S. Achuthanandan</b> siguiendo el orden apellido-nombre de su padre-nombre de pila. </p>
    <p>En muchos lugares del mundo, partes de los nombres derivan de t&iacute;tulos, ubicaciones, informaci&oacute;n geneal&oacute;gica, casta, referencias religiosas, etc.. Algunos ejemplos ser&iacute;an:</p>
    <ul>
      <li>
        <p>el nombre indio <b class="highlight">Kogaddu Birappa Timappa Nair </b>sigue el orden nombre del pueblo-nombre de su padre-nombre de pila-apellido.</p>
      </li>
      <li>el nombre rajastan&iacute; <b class="highlight">Aditya Pratap Singh Chauhan </b>sigue el orden nombre de pila-nombre de su padre-apodo-nombre de su casta.</li>
      <li>
        <p>en otra parte de la India, el nombre <b class="highlight">Madurai Mani Iyer </b>sigue el orden nombre de su ciudad-nombre de pila-nombre de su casta.</p>
      </li>
      <li>
        <p>el nombre &aacute;rabe <b class="highlight">Abu Karim Muhammad al-Jamil ibn Nidal ibn Abdulaziz al-Filistini</b> se traduce como «padre de Karim, Muhammad (nombre de pila), el Hermoso, hijo de Nidal, hijo de Abdulaziz, el Palestino». Karim es el primer hijo de Muhammad. (Para m&aacute;s detalles sobre esta rica tradici&oacute;n onom&aacute;stica, v&eacute;ase <a class="print" href="https://es.wikipedia.org/wiki/Onom%C3%A1stica_%C3%A1rabe" title="Onom&aacute;stica &aacute;rabe">Wikipedia</a>.)</p>
      </li>
    </ul>
    <p>En Tailandia, es muy frecuente el uso de apodos que no tienen relaci&oacute;n alguna con el nombre de esa persona, pero que se usan normalmente en un ambiente coloquial (tambi&eacute;n lo usan cuando se presentan a un p&uacute;blico occidental por su facilidad de pronunciaci&oacute;n, ya que suelen ser de una o dos s&iacute;labas). El ex primer ministro <b class="highlight">Thaksin Shinawatra</b> usa como apodo <b class="highlight">Maew</b> (แม้ว). A menudo, tambi&eacute;n usan diferentes apodos para sus familiares y amigos.</p>
    <p>En Vietnam, los nombres como <b class="highlight">Nguyễn Tấn Dũng</b> siguen el orden apellido-segundo nombre-nombre de pila. Aunque este caso sea similar al ejemplo chino mencionado anteriormente, el primer ministro de Vietnam usar&iacute;a su <em>nombre de pila</em> hasta en un ambiente formal, es decir, se dirigir&iacute;an a &eacute;l como Sr. Dũng en lugar de Sr. Nguyễn.</p>
  </section>
  
  <section>
    <h3 id="japanese"><a href="#japanese">Ambig&uuml;edad en la escritura</a></h3>
    <p>Los caracteres ideogr&aacute;ficos de los nombres japoneses pueden pronunciarse de varias maneras. En algunos casos, esto hace que sea complejo saber exactamente c&oacute;mo pronunciar un nombre, adem&aacute;s de causar problemas para la ordenaci&oacute;n autom&aacute;tica y la recuperaci&oacute;n de nombres, que tienen su base en la pronunciaci&oacute;n de estos. Por ejemplo, el apellido <b class="highlight">東海林賢蔵</b> (es decir, los tres primeros caracteres ideogr&aacute;ficos de la izquierda) se puede transcribir o pronunciar como Tōkairin o Shōji.</p>
    <p>Adem&aacute;s, varios caracteres kanji se pueden pronunciar de la misma manera, por lo que se pierde informaci&oacute;n relevante y caracter&iacute;stica del nombre al romanizarlo (es decir, en su transcripci&oacute;n al alfabeto latino). Por ejemplo, 庄司, 庄子, 東海林 y 小路 pueden romanizarse como Shōji.</p>
    <p> Algunos nombres japoneses est&aacute;n compuestos por caracteres ideogr&aacute;ficos arcaicos o actualmente en desuso, lo que hace que no se pueda reconocer su pronunciaci&oacute;n.</p>
    <p>Como consecuencia, los japoneses suelen dar una versi&oacute;n fon&eacute;tica de su nombre junto con la versi&oacute;n escrita habitual (usando un alfabeto japon&eacute;s kana que no sea ideogr&aacute;fico). </p>
  </section>
  
  <section>
    <h3 id="morenames"><a href="#morenames">M&aacute;s informaci&oacute;n</a></h3>
    <p>Para este art&iacute;culo se han usado tan solo algunos casos para describir la importancia de estas diferencias a la hora de construir nombres alrededor del mundo. No obstante, es un asunto muy complejo incluso tratando una sola cultura. Wikipedia recoge una gran cantidad de art&iacute;culos fascinantes sobre onom&aacute;stica en diferentes culturas del mundo. Se recomienda su lectura para obtener informaci&oacute;n m&aacute;s detallada acerca de este tema a trav&eacute;s de los siguientes enlaces:</p>
    <p><a class="print" href="http://en.wikipedia.org/wiki/Akan_names" title="Nombres ak&aacute;nicos (en ingl&eacute;s)">Akan</a> • <a class="print" href="http://en.wikipedia.org/wiki/German_name" title="Nombre alem&aacute;n (en ingl&eacute;s)">Alem&aacute;n</a> • <a class="print" href="https://es.wikipedia.org/wiki/Onom%C3%A1stica_%C3%A1rabe" title="Onom&aacute;stica &aacute;rabe">Árabe</a> • <a class="print" href="http://en.wikipedia.org/wiki/Balinese_name" title="Nombre balin&eacute;s (en ingl&eacute;s)">Balin&eacute;s</a> • <a class="print" href="http://en.wikipedia.org/wiki/Bulgarian_name" title="Nombre b&uacute;lgaro (en ingl&eacute;s)">B&uacute;lgaro</a> • <a class="print" href="http://en.wikipedia.org/wiki/Czech_name" title="Nombre checo (en ingl&eacute;s)">Checo</a> • <a class="print" href="https://es.wikipedia.org/wiki/Onom%C3%A1stica_china" title="Onom&aacute;stica china">Chino</a> • <a class="print" href="https://es.wikipedia.org/wiki/Onom%C3%A1stica_coreana" title="Onom&aacute;stica coreana">Coreano</a> • <a class="print" href="https://es.wikipedia.org/wiki/Nombre_espa%C3%B1ol" title="Nombre espa&ntilde;ol">Español</a> • <a class="print" href="https://es.wikipedia.org/wiki/Nombres_filipinos" title="Nombres filipinos">Filipino</a> • <a class="print" href="http://en.wikipedia.org/wiki/Fijian_name" title="Nombre fiyiano (en ingl&eacute;s)">Fiyiano</a> • <a class="print" href="http://en.wikipedia.org/wiki/French_name" title="Nombre franc&eacute;s (en ingl&eacute;s)">Franc&eacute;s</a> • <a class="print" href="https://es.wikipedia.org/wiki/Nombre_hawaiano" title="Nombre hawaiano">Hawaiano</a> • <a class="print" href="http://en.wikipedia.org/wiki/Hebrew_name" title="Nombre hebreo (en ingl&eacute;s)">Hebreo</a> • <a class="print" href="http://en.wikipedia.org/wiki/Dutch_name" title="Nombre holand&eacute;s (en ingl&eacute;s)">Holand&eacute;s</a> • <a class="print" href="http://en.wikipedia.org/wiki/Hungarian_names" title="Nombre h&uacute;ngaro (en ingl&eacute;s)">H&uacute;ngaro</a> • <a class="print" href="http://en.wikipedia.org/wiki/Indian_name" title="Nombre indio (en ingl&eacute;s)">Indio</a> • <a class="print" href="http://en.wikipedia.org/wiki/Indonesian_names" title="Nombres indonesios (en ingl&eacute;s)">Indonesio</a> • <a class="print" href="http://en.wikipedia.org/wiki/Irish_name" title="Nombre irland&eacute;s (en ingl&eacute;s)">Irland&eacute;s</a> • <a class="print" href="https://es.wikipedia.org/wiki/Nombre_island%C3%A9s" title="Nombre island&eacute;s">Islandés</a> • <a class="print" href="http://en.wikipedia.org/wiki/Italian_name" title="Nombre italiano (en ingl&eacute;s)">Italiano</a> • <a class="print" href="https://es.wikipedia.org/wiki/Onom%C3%A1stica_japonesa" title="Onom&aacute;stica japonesa">Japonés</a> • <a class="print" href="http://en.wikipedia.org/wiki/Javanese_name" title="Nombre javan&eacute;s (en ingl&eacute;s)">Javan&eacute;s</a> • <a class="print" href="http://en.wikipedia.org/wiki/Lithuanian_name" title="Nombre lituano (en ingl&eacute;s)">Lituano</a> • <a class="print" href="http://en.wikipedia.org/wiki/Malaysian_names" title="Nombres malayos (en ingl&eacute;s)">Malayo</a> • <a class="print" href="https://es.wikipedia.org/wiki/Nombres_mongoles" title="Nombres mongoles">Mongol</a> • <a class="print" href="https://es.wikipedia.org/wiki/Nombre_persa" title="Nombre persa">Persa</a> • <a class="print" href="https://es.wikipedia.org/wiki/Nombres_polacos" title="Nombres polacos">Polaco</a> • <a class="print" href="http://en.wikipedia.org/wiki/Portuguese_name" title="Nombre portugués (en inglés)">Portugués</a> • <a class="print" href="http://en.wikipedia.org/wiki/Eastern_Slavic_naming_customs" title="Nombres eslavos orientales">Ruso</a> • <a class="print" href="http://en.wikipedia.org/wiki/Naming_customs_of_Taiwanese_aborigines" title="Nombres taiwaneses (en ingl&eacute;s)">Taiwan&eacute;s</a> • <a class="print" href="http://en.wikipedia.org/wiki/Thai_name" title="Nombres tailandeses (en ingl&eacute;s)">Tailand&eacute;s</a> • <a class="print" href="http://en.wikipedia.org/wiki/Vietnamese_name" title="Nombre vietnamita (en ingl&eacute;s)">Vietnamita</a></p>
  </section>
</section>


<section>
  <h2 id="fielddesign"><a href="#fielddesign">Consecuencias para el diseño del campo</a></h2>
  <aside class="insidenote"><img src="qa-personal-names-data/firstmlast_ES.png" alt=" "  style="border-radius: 5px;"/></aside>
  <p>Como ya hemos mencionado anteriormente, una posible alternativa ser&iacute;a localizar los formularios a cada cultura. En teor&iacute;a, esta opci&oacute;n te permitir&iacute;a adaptar los formularios exactamente a las necesidades de tu p&uacute;blico. Sin embargo, existe un gran n&uacute;mero de desventajas:</p>
  <ul>
    <li>Si necesitas reunir informaci&oacute;n de distintas configuraciones regionales dentro de una &uacute;nica base de datos, el uso de dise&ntilde;os de formularios localizados simplemente aplazar&aacute; las dificultades de sintetizar la informaci&oacute;n de las diferentes culturas hasta que necesites almacenarla.</li>
    <li>Incluso dentro de un mismo pa&iacute;s existen diferentes maneras de formar nombres propios debido a, por ejemplo, la existencia de extranjeros viviendo en ese pa&iacute;s, los distintos elementos culturales dentro del mismo pa&iacute;s (por ejemplo, los singapurenses tienen nombres de origen chino, malayo y del sur de la India) o simplemente por las distintas maneras de usar los nombres. Por consiguiente, tus formularios tendr&aacute;n que ser algo flexibles.</li>
  </ul>
  <p>A continuaci&oacute;n proponemos algunas directrices que podr&iacute;an servir de ayuda. Desafortunadamente, estamos tratando un tema complejo y todas estas sugerencias son para casos generales y no ser&aacute;n &uacute;tiles para todos los problemas que puedan existir. </p>
  <section>
    <h3 id="singlefield"><a href="#singlefield">¿Separar o juntar todo?</a></h3>
    <p>Si vas a dise&ntilde;ar un formulario que acepte nombres de personas con distintos or&iacute;genes, deber&iacute;as<mark id="req_onefield" class="requirement">preguntarte si necesitas realmente tener campos separados para el nombre de pila y el apellido</mark>.</p>
    <p>Esto depender&aacute; de lo que hagas con esta informaci&oacute;n, pero ser&iacute;a mucho m&aacute;s sencillo, en caso de que fuera posible, usar simplemente el nombre completo tal y como lo escribir&iacute;a el usuario.</p>
    <figure class="example">
      <div class="sample_form">
        <p class="form_title">Tu perfil</p>
        <p>
          <label for="fullname">Nombre completo</label><br /><input id="fullname" value="" type="text" style="width:250px;" />
        </p>
      </div>
    </figure>
    <p>Ten en cuenta que los nombres de otras culturas pueden ser mucho m&aacute;s largos.<mark id="req_longfield" class="requirement">Haz los campos de entrada lo suficientemente extensos como para introducir nombres largos y aseg&uacute;rate de que haya espacio suficiente en la p&aacute;gina web donde se vaya a mostrar</mark>. Adem&aacute;s,<mark class="requirement">evita limitar el tama&ntilde;o del campo para nombres en tu base de datos.</mark>En particular, no des por hecho que un nombre japon&eacute;s de cuatro caracteres en UTF-8 se podr&aacute; ajustar en cuatro bytes, ya que probablemente necesites 12.</p>
  </section>
  
  <section>
    <h3 id="splitting"><a href="#splitting">Estrategias para separar nombres</a></h3>
    <p>Si necesitas preguntar por partes del nombre por separado,<mark class="requirement">intenta evitar el uso de etiquetas como «nombre de pila» o «apellido» en formularios no localizados</mark>, ya que esto puede crear confusi&oacute;n para aquellos que escriban primero su apellido seguido de nombres propios.</p>
    <figure class="example">
      <div class="sample_form">
        <p class="form_title">Tu perfil</p>
        <p>
          <label for="familyname">Apellido </label><br /><input id="familyname" value="" type="text" style="width:250px;" />
        </p>
        <p>
          <label for="othernames">Nombres de pila/otros nombres </label><br /><input id="othernames" value="" type="text" style="width:250px;" />
        </p>
      </div>
    </figure>
    <p>Esta opci&oacute;n puede seguir siendo problem&aacute;tica para algunas culturas (por ejemplo, los islandeses no tienen apellidos), pero, ante la falta de una localizaci&oacute;n personalizada, es probablemente la mejor opci&oacute;n para crear un formulario general.</p>
    <p>En ocasiones, querr&aacute;s identificar partes de un nombre con el fin de ordenar una lista de nombres alfab&eacute;ticamente, contactar con ellos, etc..<mark id="req_extrafield" class="requirement">Plant&eacute;ate si tendr&iacute;a sentido tener uno o m&aacute;s campos, adem&aacute;s del campo de nombre completo, donde el usuario introduzca la(s) parte(s) de su nombre que necesites para un fin espec&iacute;fico.</mark>
    </p>
    <aside class="insidenote"> <img src="qa-personal-names-data/circles_ES.png" alt=' ' /> </aside>
    <p>Tambi&eacute;n puedes optar por los campos separados con el fin de usar parte del nombre para dirigirte o referirte a esa persona directamente, por ejemplo, Google+ lo usar&iacute;a para indicar «Contactos de Richard». O quiz&aacute;s simplemente quieras enviar a tus usuarios un correo con sus nombres en la cabecera. Ten en cuenta que si haces esto puedes encontrarte problemas como la sintaxis del nombre o las distintas formas de mostrar formalidad en todo el mundo (habr&aacute;n personas a las que no les agrade que un desconocido se dirija a ellas por su nombre de pila). Una opci&oacute;n mejor ser&iacute;a<mark id="req_addressfield" class="requirement">preguntar por separado, por ejemplo, en la configuraci&oacute;n del perfil, c&oacute;mo quiere esa persona que se dirijan a ella</mark>.</p>
    <figure class="example">
      <div class="sample_form">
        <p class="form_title">Tu perfil</p>
        <p>
          <label for="fullname3">Nombre completo</label><br /><input id="fullname3" value="" type="text" style="width:250px;" />
        </p>
        <p>
          <label for="salutation">¿C&oacute;mo deber&iacute;amos dirigirnos a usted? <span style="color:#888;">(por ejemplo, en caso de que le enviemos un correo electr&oacute;nico)</span></label><br /><input id="salutation" value="" type="text" style="width:250px;" />
        </p>
      </div>
    </figure>
    <p>Este campo extra ser&iacute;a &uacute;til para encontrar el nombre que necesites en una lista extensa y para tratar apodos tailandeses.</p>
    <p>Por cierto, para ordenar nombres japoneses tendr&aacute;s que a&ntilde;adir un campo adicional donde puedan escribir la pronunciaci&oacute;n de su nombre, ya que no lo podr&aacute;s averiguar con los caracteres ideogr&aacute;ficos. Esta informaci&oacute;n se usa para ordenar nombres japoneses.</p>
    <p>Adem&aacute;s,<mark id="req_labeling" class="requirement">si tienes campos separados para las distintas partes del nombre de una persona, aseg&uacute;rate de dejar claro qu&eacute; partes quieres en cada campo. </mark>Por ejemplo, no des por hecho que empezar&aacute;n escribiendo sus apellidos.</p>
    <p>
      <mark id="req_algorithms" class="requirement">Ten en cuenta tambi&eacute;n los supuestos en los que los algoritmos eliminan autom&aacute;ticamente partes de un nombre</mark>. Por ejemplo, el planteamiento de la <a class="print" href="http://microformats.org/wiki/hcard#Implied_.22N.22_Optimization">optimizaci&oacute;n de «n» impl&iacute;cita</a> en vCard y hCard podr&iacute;a tener problemas con los nombres chinos, por ejemplo. Deber&iacute;as<mark id="clearlabels" class="requirement">ser lo m&aacute;s claro posible cuando pidas a alguien que indique su nombre</mark>para conseguir la informaci&oacute;n que necesites.</p>
    <p>
      <mark id="req_singleletter" class="requirement">Tampoco des por hecho que un nombre de una sola letra es una inicial,</mark>ya que existen nombres de esta longitud. Estas personas podr&iacute;an tener problemas si el formulario no acepta su nombre y les pide que escriba su nombre completo. Si quieres que no se utilicen iniciales, deber&iacute;as crear un mensaje de advertencia en lugar de bloquear el env&iacute;o del formulario.</p>
    <p>Asimismo,<mark id="req_nofamily" class="requirement">no incluyas un campo exclusivo para el apellido.</mark>En culturas como las del sur de la India, Malasia e Indonesia la mayor&iacute;a de las personas tienen tan solo un nombre de pila, sin patron&iacute;micos. Si mantienes el campo para apellidos, te encontrar&aacute;s con problemas importantes en estas culturas, ya que tender&aacute;n a escribir informaci&oacute;n que no es relevante, como un punto o «Sr.» para completar el formulario.</p>
  </section>
  
  <section>
    <h3 id="otherthings"><a href="#otherthings">Otros consejos</a></h3>
    <p>
      <mark id="req_hyphens" class="requirement">No olvides permitir el uso de signos de puntuaci&oacute;n como guiones, ap&oacute;strofos, etc..</mark>
      <mark id="req_case" class="requirement">No pidas que escriban su nombre en may&uacute;sculas,</mark>ya que puede ser m&aacute;s complicado en un dispositivo m&oacute;vil.<mark id="req_spaces" class="requirement">Permite que el usuario introduzca su nombre con espacios</mark>, por ejemplo, para los prefijos y sufijos como «de» en franc&eacute;s, «von» en alem&aacute;n y Jnr/Jr en nombres americanos o para aquellos que su nombre se indique con un espacio, como Rose Marie.</p>
    <p>
      <mark id="req_samefamily" class="requirement">No des por hecho que los miembros de la misma familia comparten el mismo apellido.</mark>
    </p>
    <p>Como ya hemos mencionado anteriormente, para aquellos que hayan contra&iacute;do matrimonio,<mark class="requirement">la mejor opci&oacute;n es preguntar por el «Apellido anterior», en lugar del «Apellido de soltero/a»</mark>. </p>
    <p>Si vas a dise&ntilde;ar formularios que van a ser localizados para cada cultura, no olvides que las partes de nombres atomizados pueden ser necesarias para una base de datos central. Esta, por consiguiente, tiene que ser capaz de representar todas estas complejidades relegando el dise&ntilde;o del formulario a un esfuerzo de localizaci&oacute;n.</p>
  </section>
</section>


<section>
  <h2 id="encoding"><a href="#encoding">Consecuencias en la compatibilidad de caracteres</a></h2>
  <p>Lo primero que los angloparlantes tienen que tener en cuenta al tratar otros nombres es que la gran mayor&iacute;a no utilizan un alfabeto latino y, los que <em>s&iacute;</em> lo usan, tambi&eacute;n pueden usar acentos y caracteres que no est&aacute;n presentes en ingl&eacute;s. Parece algo bastante obvio, sin embargo, tiene consecuencias muy importantes cuando pasa desapercibido por los dise&ntilde;adores.</p>
  <div class="sidenoteGroup">
    <p>Si est&aacute;s dise&ntilde;ando un formulario en ingl&eacute;s, tienes que decidir si quieres que tus usuarios escriban sus nombres en su propio alfabeto (por ejemplo, 小林康宏), en su transcripci&oacute;n latina (como Yasuhiro Kobayashi) o en ambas formas. </p>
    <p>Ten en cuenta que hasta algunos nombres en ingl&eacute;s pueden contener caracteres que no sean ASCII (por ejemplo, Zo&euml;).</p>
    <p>Por otro lado, tambi&eacute;n existen casos en los que se usan sistemas que admiten &uacute;nicamente caracteres ASCII, como en el nombre de inicio de sesi&oacute;n.</p>
    <p>Lo que vaya a escribir cada usuario en el formulario depender&aacute; de si el mismo y la p&aacute;gina web est&aacute;n en su idioma o no. No te sorprendas si te encuentras con caracteres no latinos o caracteres latinos con acentos si la p&aacute;gina web est&aacute; en su propio idioma.</p>
    <aside class="sideinfonote"><p class="info">Con respecto a las letras, un sistema de caracteres ASCII significa que utiliza las letras del alfabeto ingl&eacute;s, es decir, ABCDEFGHIJKLMNOPQRSTUVWXYZ (may&uacute;sculas y min&uacute;sculas).</p></aside>
  </div>
  <div class="sidenoteGroup">
    <p>
      <mark id="req_asciionly" class="requirement">Si quieres que tus usuarios usen caracteres latinos o solo ASCII, tendr&aacute;s que indicarlo.</mark>
    </p>
    <aside class="sideinfonote"><p class="warning">No olvides comentarles a los traductores de tu p&aacute;gina web que se explique esto a los usuarios.</p></aside>
  </div>
  <figure class="example">
    <div class="sample_form">
      <p class="form_title">Tu perfil</p>
      <p>
        <label for="asciionly">Nombre completo&nbsp; <span style="color:#888;">(Utiliza letras de la A a la Z sin acentos)</span></label><br /><input id="asciionly" value="" type="text" style="width:250px;" />
      </p>
    </div>
  </figure>
  <p>Decidir cu&aacute;l es el m&eacute;todo m&aacute;s apropiado depender&aacute; en parte de la finalidad de recopilar esos nombres y c&oacute;mo los piensas utilizar.</p>
  <ul>
    <li>¿Est&aacute;s recopilando nombres para tener un identificador en tu sistema? En este caso, no importa realmente si el nombre se almacena en caracteres ASCII o en su alfabeto nativo.</li>
    <li>¿O vas a usar su nombre en una p&aacute;gina principal o para correspondencia? Si vas a tener una correspondencia usando su nombre en p&aacute;ginas escritas en su propio idioma, lo m&aacute;s adecuado ser&iacute;a tener su nombre en su alfabeto nativo.</li>
    <li>¿Es importante el hecho de reconocer y usar ese nombre para alguien de tu organizaci&oacute;n que se encargue de gestionar consultas? En este caso, deber&iacute;as pedir una transcripci&oacute;n latina.</li>
    <li>¿Va a ser ese nombre visible o se utilizar&aacute; en b&uacute;squedas (por ejemplo, Flickr da la opci&oacute;n de mostrar los nombres adem&aacute;s del nombre de usuario en su p&aacute;gina de perfil)? ¿O querr&aacute;s enviarle correspondencia en su propio idioma manteniendo el nombre en tu sistema en otro idioma como el ingl&eacute;s? En este caso,<mark id="req_asciiandnative" class="requirement">tendr&aacute;s que almacenar el nombre en los alfabetos latino y nativo. Para ello, tendr&aacute;s que pedirle al usuario en campos separados que escriba su nombre en ambos alfabetos</mark>.</li>
  </ul>
  <figure class="example">
    <div class="sample_form">
      <p class="form_title">Tu perfil</p>
      <p>
        <label for="ownalphabet">Nombre (en tu alfabeto)</label><br /><input id="ownalphabet" value="" type="text" style="width:250px;" />
      </p>
      <p>
        <label for="latinonly">Transcripci&oacute;n latina (en caso de ser diferente)</label><br /><input id="latinonly" value="" type="text" style="width:250px;" />
      </p>
    </div>
  </figure>
  <p>Ten en cuenta que los usuarios japoneses tendr&aacute;n que escribir una transcripci&oacute;n en un alfabeto sil&aacute;bico japon&eacute;s, adem&aacute;s de su forma ideogr&aacute;fica. Esto podr&iacute;a hacer que fuera necesario un tercer campo en el ejemplo anterior.</p>
  <p>
    <mark id="req_useunicode" class="requirement">Si aceptas nombres escritos en caracteres que no sean ASCII, deber&iacute;as usar una codificaci&oacute;n de caracteres Unicode (por ejemplo, UTF-8) en tus p&aacute;ginas, en tus bases de datos back-end y en todo el c&oacute;digo software que aparezca.</mark>Esto te servir&aacute; de gran ayuda.</p>
</section>


<section>
  <h2 id="bytheway"><a href="#bytheway">A tener en cuenta</a></h2>
  
  <section>
    <h3 id="sorting"><a href="#sorting">Un consejo en cuanto a la ordenaci&oacute;n</a></h3>
    <p>Las listas de nombres de todo el mundo no suelen estar ordenadas por apellido. Por ejemplo, las listas de Tailandia e Islandia suelen ordenarse por nombre propio.</p>
    <p>Los criterios de ordenaci&oacute;n pueden ser diferentes tambi&eacute;n en los distintos pa&iacute;ses hispanohablantes. Por ejemplo, una Mar&iacute;a Jos&eacute; Carre&ntilde;o Qui&ntilde;ones buscar&iacute;a su nombre ordenado por Carre&ntilde;o Qui&ntilde;ones, mientras que otra lo buscar&iacute;a por Qui&ntilde;ones.</p>
    <p>El trato de palabras cortas como «von», «de» y «van» complican a&uacute;n m&aacute;s la ordenaci&oacute;n. Estos prefijos pueden tener importancia en algunas ocasiones.</p>
  </section>
  
  <section>
    <h3 id="formality"><a href="#formality">Formalidad y menciones honor&iacute;ficas</a></h3>
    <p>Los niveles de formalidad var&iacute;an seg&uacute;n la cultura. Hay que tener esto en cuenta cuando te dirijas a alguien. Los nombres propios se han convertido en la forma m&aacute;s popular de dirigirte a alguien en Occidente y en c&iacute;rculos tecnol&oacute;gicos. No obstante, esto no es apropiado a nivel mundial. Contactar con alguien del Reino Unido por primera vez usando su nombre de pila puede significar que ya conoces a esa persona.</p>
    <p>Por otro lado, dirigirte a alguien usando un t&iacute;tulo y su nombre propio (por ejemplo, «Sr. Edward») o por su apellido (por ejemplo, «¡Windsor!») es aceptado en algunas partes del mundo pero no en todas (como por ejemplo en Reino Unido).</p>
    <p>Los t&iacute;tulos son muy importantes en Alemania y puede que tengas que dirigirte a alguien como Herr Professor Doktor Schmidt, en lugar de Herr Schmidt.</p>
    <p>En una cultura como la japonesa es habitual a&ntilde;adir una menci&oacute;n honor&iacute;fica o un cargo al nombre. Por ejemplo, ser&iacute;a normal referirse a alguien como Tanaka-san o Tanaka-sama (dependiendo de la relaci&oacute;n con esa persona). A un jefe de departamento que se llame Tanaka se le llamar&iacute;a Tanaka-bucho (jefe de departamento Tanaka). Aunque se pueda a&ntilde;adir -san a los nombres propios, ser&iacute;a poco habitual hacerlo con gente en tu entorno laboral.</p>
  </section>
</section>


<section> 
<h2 id="endlinks"><a href="#endlinks">Bibliograf&iacute;a adicional</a></h2>
<aside class="section" id="survey"> </aside><script>document.getElementById('survey').innerHTML = g.survey</script>

  <ul id="full-links">
    <li>
      <p>V&eacute;anse los art&iacute;culos de Wikipedia de la secci&oacute;n <a href="#morenames">M&aacute;s informaci&oacute;n</a>.</p>
    </li>
    <li>
      <p>Informaci&oacute;n adicional en <a href="http://www.w3.org/International/wiki/Personal_names">comentarios de este art&iacute;culo</a>.</p>
    </li>
    <li>
      <p>V&iacute;nculos relacionados: <cite>Authoring HTML &amp; CSS</cite></p>
      <ul>
      	<li><a href="/International/techniques/authoring-html#cultural">Problemas culturales</a></li>
      </ul>
    </li>
  </ul>
</section>

<footer id="thefooter"></footer><script type="text/javascript">document.getElementById('thefooter').innerHTML = g.bottomOfPage</script>
<script type="text/javascript">completePage()</script>
</body>
</html>
